__author__ = 'Богушевич Д.А.'

def sum_sqr(a:int, b:int) -> int:
    """
    Функция нахождения суммы квадратов
    :param a: Первое число
    :param b: Второе число
    :return: сумма квадратов
    """
    return a ** 2 + b ** 2

def sqr_sum(r:int,s:int) -> int:
    """
    Функция нахождения квадрата суммы двух чисел
    :param r: Первое число
    :param s: Второе число
    :return: результат квадрат суммы
    """
    return (r + s) ** 2

#Функция сравнения и вывода ответа
def result(q: int,j: int) -> int:
    """
    Функция сравнения и вывода ответа
    :param q: Сумма квадратов
    :param j: Квадрат суммы
    """
    if q>j:
        print ("Сумма квадратов больше квадрата суммы")
        return 1
    else:
        print ("Квадрат суммы больше суммы квадрата")
        return 0


#Блок проверки функций
#Проверка работоспособности функции суммы квадратов
assert sum_sqr(2,3) == 13
assert sum_sqr(0,0) == 0
assert sum_sqr(-2,-3) == 13

#Проверка работоспособности функции квадрата суммы
assert sqr_sum(2,3) == 25
assert sqr_sum(3,-5) == 4
assert sqr_sum(0,0) == 0

#Проверка ответа
assert result(13,25) == 0
assert result(34,4) == 1
